# 예상 시간 복잡도 O(n)

def solution(word):
    answer = 0
    tt = [781, 156, 31, 6, 1]
    d = {'A':0, 'E':1, 'I':2, 'O':3, 'U':4}
    l = len(word)
    for i,x in enumerate(word):
        answer += (tt[i]*d[x]+1)
    return answer

'''
A 시작  : 1 / 5 / 5^2 / 5^3 / 5^4 => 781  
E 시작 :  => 781 
I 
두번째 A 시작 : 1/5/25/125 => 
   2651
    
    A : [1,1,1,1,1]
    E : [781+1, 156 +1 , 31 +1 , 6+1, 1+1  ]
    I : [1562 +1, 156*2 +1, 31*2 + 1  ]
    O : [781*3+1, 156*3 +1, ]
    U : [781*4+1, 156*4 +1, ]
    781+1 + 156*2 +1 + 31*3+1'''

